using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class SynopsisConst : MonoBehaviour
{
    public readonly string[] synopsisDialogues = new string[]
    {
        "세계는 거대한 세계수를 중심으로 다양한 세계로 구성되어 있다.",
        "신들은 인간 세계의 삶을 돕기 위해 자신의 권능 일부를 룬의 형태로 자연 속에 남겼고",
        "인간들은 룬을 통해 마법서를 만들어 마법을 사용하며, 룬의 시대가 열리게 되었다.",
        "기원후 x5년",
        "룬의 힘은 강력했고, 인간들은 룬의 힘을 악용하기 시작하며, 일부 인간 집단은 \"신을 쓰러뜨리고 권능을 완전히 장악하자\"는 극단적 목적을 품게된다.",
        "신들은 인간의 오만을 목격하고, 사태를 해결하기 위해 회의를 소집한다.",
        "\"인간을 제거하고 룬을 회수하여 세계의 질서를 다시 회복해야 한다.\"",
        "\"더 이상 인간 세계의 관심을 끊고 다른 세계와 격리해야 한다.\"",
        "\"인간과 신 모두 공존할 수 있는 미래를 찾아야 한다.\"",
        "신들 간의 신념이 충돌하며, 회의는 끝없이 이어졌다.",
        "그 때 시간의 신은 세계수의 뿌리 너머, 운명의 샘에서 '인간이 신을 전복시키는 미래'와 '신이 인간을 멸종시키는 미래'를 보게 된다.",
        "시간의 신이 시간을 거슬러 개입하는 일은 신의 권능 대부분을 소진하기 떄문에 쉽지 않은 일이었다.",
        "결국 시간의 신은 '시간의 룬'을 만들어 한 존재에게 건네며 말한다.",
        "\"세계가 멸망하지 않도록, 인간 세계에 퍼져있는 룬을 모두 회수해야 한다.\"", //인간과 신 사이의 평화와 질서를 되돌려야한다.
        "\"네가 세계의 마지막 희망이다.\""



    };

}
